describe("addressBook", () => {


  describe("state",()=>{

  })

  describe("mutations",()=>{
    it("새로운 주소록이 추가된다",()=>{});
    it("첫번째 주소록을 클릭한 후 자식 주소록이 추가되도록 한다",()=>{})
    it('첫번째 주소록에 2번째 주소록의 자식 주소록 이 추가 된다.',()=>{});
    it("첫번째 주소록의 이름을 변경한다",() =>{});
    it("첫번째 주소록의 2번째 자식 주소록의 이름을 변경한다.",()=>{});
    it("첫번째 주소록을 삭제한다",()=>{});
    it("첫번째 주소록에 2번째 자식 주소록을 삭제한다.",()=>{});

    it("첫번째 주소록에 사용자를 추가한다.",()=>{});
    it("첫번째 주소록에",()=>{})
    it("",()=>{})
  })

  describe("actions",()=>{

  })
  describe("getters",()=>{

  })
});



